app/views/pages/home.html.erb

UPDATE "bookings" SET "user_id" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["user_id", 100], ["updated_at", "2017-10-11 09:07:48.967105"], ["id", 169]]
---

      $.ajax({
        url: '/trips',
        method: 'POST',
        dataType: 'json',
        data: { trip: {
            address: addressObj.address,
            latitude: addressObj.lat,
            longtitude: addressObj.lng
          } },
        // The AJAX request will return a list of all the bookings
        success: function success(response) {
          bookings = response.bookings;
          console.log(bookings);
          origin = { lat: addressObj.lat, lng: addressObj.lng };
          var destinations = [];
          for (var i = 0; i < bookings.length; i++) {
            // We need to check that the bookings aren't already completed, nor are they part of a trip. We do this by checking if there is an associaton before pushing into destinations.
            if (bookings[i].trip_id === null) {
              // destinations.push({ lat: bookings[i].latitude, lng: bookings[i].longtitude, ad: bookings[i].address, id: bookings[i].id });
              destinations.push(bookings[i].address)
            }