app/controllers/bookings_controller.rb

  def create
    # Before creating a new booking, let's check if the last booking is still active, if so let's destroy it.
    if @current_user.bookings.last.present?
      b = @current_user.bookings.last
      b.destroy if b.dropped_off.nil?
    end
    booking = Booking.create booking_params
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 ORDER BY "bookings"."id" DESC LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 3]]
INSERT INTO "bookings" ("latitude", "longtitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["latitude", -33.8930003], ["longtitude", 151.207172], ["created_at", "2017-10-09 05:34:14.416139"], ["updated_at", "2017-10-09 05:34:14.416139"]]

  def show
    booking = Booking.find params[:id]

    if booking.trip.present?
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 133], ["LIMIT", 1]]

  def update
    # We are going to be making 3 requests to this method. The first to let the user now that their dog is now in a trip, the second to update the server that the dog has been picked up, and the third to let the database now the dog has been dropped off.
    booking = Booking.find params[:id]
    if booking.trip_id.nil?
      @current_user.trips.last.bookings << booking
      respond_to do |format|
        format.html {}
        format.json { render status: :created }
      end
    elsif booking.picked_up.nil?
      booking.update(picked_up: DateTime.current)
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = $1 ORDER BY "trips"."id" DESC LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
UPDATE "bookings" SET "dropped_off" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["dropped_off", "2017-10-11 05:38:01.497332"], ["updated_at", "2017-10-11 05:38:01.498790"], ["id", 136]]

  def destroy
    booking = Booking.find params[:id]
    booking.destroy
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 103], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 103]]