app/controllers/trips_controller.rb

INSERT INTO "trips" ("user_id", "created_at", "updated_at", "address") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["created_at", "2017-10-09 07:04:53.135598"], ["updated_at", "2017-10-09 07:04:53.135598"], ["address", "433 Alfred St N, Neutral Bay NSW 2089, Australia"]]
SELECT "bookings".* FROM "bookings"
---
  def create
    @trip = Trip.create trip_params
    @current_user.trips << @trip

    respond_to do |format|
      format.html {}
      format.json { render json: {:bookings => Booking.all} }